import pytest


@pytest.fixture
def user_settings_json():
    return {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "AMZN", "GOOGL", "MSFT", "TSLA"]}


@pytest.fixture
def open_file_xlsx():
    return [
        {
            "Дата операции": "03.01.2018 14:55:21",
            "Дата платежа": "05.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -21.0,
            "Сумма платежа": -21.0,
            "Валюта платежа": "RUB",
            "Категория": "Красота",
            "Описание": "OOO Balid",
        }
    ]


@pytest.fixture
def sort_date():
    return [
        {
            "Дата операции": "03.01.2018 15:03:35",
            "Дата платежа": "04.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -73.06,
            "Сумма платежа": -73.06,
            "Валюта платежа": "RUB",
            "Категория": "Супермаркеты",
            "Описание": "Magazin 25",
        },
        {
            "Дата операции": "03.01.2018 14:55:21",
            "Дата платежа": "05.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -21.0,
            "Сумма платежа": -21.0,
            "Валюта платежа": "RUB",
            "Категория": "Красота",
            "Описание": "OOO Balid",
        },
        {
            "Дата операции": "01.01.2018 20:27:51",
            "Дата платежа": "04.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -316.0,
            "Сумма платежа": -316.0,
            "Валюта платежа": "RUB",
            "Категория": "Красота",
            "Описание": "OOO Balid",
        },
    ]


@pytest.fixture
def sort_date_1():
    return [
        {
            "Дата операции": "01.01.2018 12:49:53",
            "Дата платежа": "01.01.2018",
            "Номер карты": "nan",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Сумма платежа": -3000.0,
            "Валюта платежа": "RUB",
            "Категория": "Переводы",
            "Описание": "Линзомат ТЦ Юность",
        }
    ]


@pytest.fixture
def sort_date_2():
    return [
        {
            "Дата операции": "01.01.2018 12:49:53",
            "Дата платежа": "01.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -3000.0,
            "Сумма платежа": "nan",
            "Валюта платежа": "RUB",
            "Категория": "Переводы",
            "Описание": "Линзомат ТЦ Юность",
        }
    ]


@pytest.fixture
def sort_date_3():
    return [
        {
            "Дата операции": "03.01.2018 15:03:35",
            "Дата платежа": "nan",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -73.06,
            "Сумма платежа": -73.06,
            "Валюта платежа": "RUB",
            "Категория": "Супермаркеты",
            "Описание": "Magazin 25",
        }
    ]
